In [1]:
import numpy as np
import pandas as pd

# Read Data

In [2]:
students = pd.read_csv('Expanded_data_with_more_features.csv')
students

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30636,816,female,group D,high school,standard,none,single,sometimes,no,2.0,school_bus,5 - 10,59,61,65
30637,890,male,group E,high school,standard,none,single,regularly,no,1.0,private,5 - 10,58,53,51
30638,911,female,NaN,high school,free/reduced,completed,married,sometimes,no,1.0,private,5 - 10,61,70,67
30639,934,female,group D,associate's degree,standard,completed,married,regularly,no,3.0,school_bus,5 - 10,82,90,93
30640,960,male,group B,some college,standard,none,married,never,no,1.0,school_bus,5 - 10,64,60,58

## Total size of Data

In [3]:
total_size = len(students)
total_size

30641

### Проаналізуйте розподіл за статтю серед учнів.
1. Скільки студентів і студенток у наборі даних?
1. Який відсоток студентів чоловічої статі в наборі даних?
1. Який відсоток студенток у наборі даних?

In [4]:
pd.set_option('display.precision', 2)

# male / female
male = len(students[ students['Gender'] == 'male' ])
female = len(students[ students['Gender'] == 'female' ])
dct = {'Total amount': [male, female], 'Part (%)': [male / total_size * 100., female / total_size * 100.]}

pd.DataFrame(dct, index=['Male', 'Female'])

        Total amount  Part (%)
Male           15217     49.66
Female         15424     50.34

### Дослідіть зв’язок між етнічною групою та результатами тестів.
1. Яка етнічна група має найвищий середній бал з математики?
1. Яка етнічна група має найвищий середній бал читання?
1. Яка етнічна група має найвищий середній бал з письма?

In [5]:
list_of_groups = ['group A', 'group B', 'group C', 'group D', 'group E']
list_of_scores = ['MathScore', 'ReadingScore', 'WritingScore']

ROWS = []
for g in list_of_groups:
    grp_X = students[ students['EthnicGroup'] == g]

    dct = {}
    for s in list_of_scores:
        dct[s] = grp_X[s].mean()

    ROWS.append( dct )
    
EthnicGroup_df = pd.DataFrame(ROWS, index=list_of_groups)
EthnicGroup_df

         MathScore  ReadingScore  WritingScore
group A      62.99         66.79         65.25
group B      63.49         67.32         65.90
group C      64.70         68.44         67.00
group D      67.67         70.38         70.89
group E      75.30         74.25         72.68

In [6]:
math_max = EthnicGroup_df['MathScore'].max()
print(math_max)
EthnicGroup_df[ EthnicGroup_df['MathScore'] == math_max ]

75.29893590695373

         MathScore  ReadingScore  WritingScore
group E       75.3         74.25         72.68

In [7]:
reading_max = EthnicGroup_df['ReadingScore'].max()
print(reading_max)
EthnicGroup_df[ EthnicGroup_df['ReadingScore'] == reading_max ]

74.25142291512002

         MathScore  ReadingScore  WritingScore
group E       75.3         74.25         72.68

In [8]:
writing_max = EthnicGroup_df['WritingScore'].max()
print(writing_max)
EthnicGroup_df[ EthnicGroup_df['WritingScore'] == writing_max ]

72.67706013363029

         MathScore  ReadingScore  WritingScore
group E       75.3         74.25         72.68

### Дослідіть вплив курсу підготовки до тесту на результати тесту.
1. Який середній бал з математики для студентів, які закінчили курс підготовки до тесту?
1. Який середній бал з читання для студентів, які пройшли курс підготовки до тесту?
1. Який середній бал для студентів, які закінчили курс підготовки до тесту?

In [9]:
list_of_results = ['none', 'completed']
list_of_scores = ['MathScore', 'ReadingScore', 'WritingScore']

ROWS = []
for r in list_of_results:
    grp_X = students[ students['TestPrep'] == r]

    dct = {}
    for s in list_of_scores:
        dct[s] = grp_X[s].mean()

    ROWS.append( dct )
    
TestPrep_df = pd.DataFrame(ROWS, index=list_of_results)
TestPrep_df

           MathScore  ReadingScore  WritingScore
none           64.95         67.05         65.09
completed      69.55         73.73         74.70

In [10]:
pd.DataFrame(TestPrep_df.loc['completed'].values, columns=['completed'], index=list_of_scores).T

           MathScore  ReadingScore  WritingScore
completed      69.55         73.73          74.7

### Проаналізуйте розподіл батьків(ів) за сімейним станом серед учнів.
1. Скільки студентів мають одружених батьків?
1. Скільки студентів мають батьків-одинаків?

In [11]:
pd.set_option('display.precision', 2)

# single / married
married = len(students[ students['ParentMaritalStatus'] == 'married' ])
single = len(students[ students['ParentMaritalStatus'] == 'single' ])
dct = {'Total amount': [married, single], 'Part (%)': [married / total_size * 100., single / total_size * 100.]}

pd.DataFrame(dct, index=['Married', 'Single'])

         Total amount  Part (%)
Married         16844     54.97
Single           7097     23.16

### Дослідіть зв’язок між заняттями спортом і результатами тестів.
1. Чи студенти, які регулярно займаються спортом, мають вищі середні результати з математики, ніж ті, хто ніколи не       займається спортом?
1. Чи студенти, які регулярно займаються спортом, мають вищі середні результати читання, ніж ті, хто ніколи не займається спортом?

In [12]:
list_of_options = ['regularly', 'sometimes', 'never']
list_of_scores = ['MathScore', 'ReadingScore', 'WritingScore']

ROWS = []
for opt in list_of_options:
    grp_X = students[ students['PracticeSport'] == opt]

    dct = {}
    for s in list_of_scores:
        dct[s] = grp_X[s].mean()

    ROWS.append( dct )
    
PracticeSport_df = pd.DataFrame(ROWS, index=list_of_options)
PracticeSport_df

           MathScore  ReadingScore  WritingScore
regularly      67.84         69.94         69.60
sometimes      66.27         69.24         68.07
never          64.17         68.34         66.52

In [13]:
print('Чи студенти, які регулярно займаються спортом, мають вищі середні результати з математики,\n\
ніж ті, хто ніколи не займається спортом?')
PracticeSport_df['MathScore']['regularly'] > PracticeSport_df['MathScore']['never']

Чи студенти, які регулярно займаються спортом, мають вищі середні результати з математики,
ніж ті, хто ніколи не займається спортом?

True

In [14]:
print('Чи студенти, які регулярно займаються спортом, мають вищі середні результати читання,\n\
ніж ті, хто ніколи не займається спортом?')
PracticeSport_df['ReadingScore']['regularly'] > PracticeSport_df['ReadingScore']['never']

Чи студенти, які регулярно займаються спортом, мають вищі середні результати читання,
ніж ті, хто ніколи не займається спортом?

True

### Проаналізуйте розподіл транспортних засобів до школи серед учнів.
1. Скільки учнів користується шкільним автобусом, щоб дістатися до школи?
1. Скільки учнів користується приватним транспортом, щоб дістатися до школи?

In [15]:
pd.set_option('display.precision', 2)

# school_bus / private
school_bus = len(students[ students['TransportMeans'] == 'school_bus' ])
private = len(students[ students['TransportMeans'] == 'private' ])
dct = {'Total amount': [school_bus, private], 'Part (%)': [school_bus / total_size * 100., private / total_size * 100.]}

pd.DataFrame(dct, index=['School bus', 'Private'])

            Total amount  Part (%)
School bus         16145     52.69
Private            11362     37.08